# Basic SQL Queries: TMDb Database

## The TMDb Database

In this challenge you will be exploring the [The Movie Database](https://www.themoviedb.org/): an online movie and TV show database, which houses some of the most popular movies and TV shows at your finger tips. The TMDb database supports 39 official languages used in over 180 countries daily and dates all the way back to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship Diagram (ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ER diagram, the TMDb database consists of `12 tables` containing information about movies, cast, genre and so much more.  

For this challenge we will only be making use of the Movies table from the TMDb database. We will be applying the use of basic SQL queries to gain insightful information from the Movies table. The Movie table consists of: 
- 15 columns
- 4804 rows
- Includes information on movie revenue, release date, popularity and so much more ! 

Let's get started!

## Loading the database

To begin and start making use of SQL queries you need to prepare your SQL environment you can do this by loading in the magic command `%load_ext sql`, next you can go ahead and load in your database. To do this you will need to ensure you have downloaded the `TMDB.sql`sqlite file. Now that you have all the prerequistes you can go ahead and load it into the notebook.

In [1]:
%load_ext sql

In [2]:
%%sql 
sqlite:///TMDB.db

## Questions on Basic SQL Queries 

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided for the multiple choice questions on Athena.

To attempt this you will use what you have learned about the following functions and statements:

- SELECT
- FROM
- WHERE
- LIKE
- COUNT
- OR
- AND
- BETWEEN

**Question 1**

What is the SQL code to see the whole movies table?

**Options:** 
- SELECT ALL FROM Movies
- SELECT TABLE FROM Movies
- SELECT * FROM Movies
- SELECT % FROM Movies

In [ ]:
%%sql 
SELECT * from movies

**Question 2**

What was the budget for the movie “Inception”?

**Options:**
- $224 000 000

- $160 000 000

- $344 000 000

- $115 000 000

In [60]:
%%sql 
SELECT budget FROM movies 
WHERE title = "Inception";

 * sqlite:///TMDB.db
Done.

[(160000000,)]

**Question 3**

What is the runtime of the movie "Titanic"?

**Options:**
- 146
- 158
- 122
- 194

In [61]:
%%sql 
SELECT runtime from movies
Where title = "Titanic"

 * sqlite:///TMDB.db
Done.

[(194.0,)]

**Question 4**

How many movies do not have English as their original language? (Hint: “en” is the abbreviation for English)

**Options:**
- 492
- 298
- 387
- 315

In [63]:
%%sql 
Select count(*) as movie_count
from movies
Where original_language != 'en';

 * sqlite:///TMDB.db
Done.

[(298,)]

**Question 5**

How many movies are there that have a popularity score of more than 250?

**Options:**
- 7
- 5
- 9
- 11

In [64]:
%%sql 
select count(*) as movie_count
from movies 
where popularity > 250

 * sqlite:///TMDB.db
Done.

[(7,)]

**Question 6**

 How many movies are there where the title is not the same as the original title?
 
 **Options:**
 -  187
 - 261
 - 74
 - 24

In [65]:
%%sql
select count(*) as movie_count
from movies
where title != original_title

 * sqlite:///TMDB.db
Done.

[(261,)]

**Question 7**

 How many movies are there that managed to get a popularity rating of more than 100 with a budget of less than $10 000 000?
 
**Options:**
 - 11
 - 18
 - 5
 - 15

In [30]:
%%sql 
Select count (*) as movie_count
from movies
where popularity >= 100 AND budget <= 10000000;

 * sqlite:///TMDB.db
Done.

[(5,)]

**Question 8** 

How many movies are there that have the word ‘love’ anywhere in the title? (Hint: The L in the word love can be upper or lower case and can be included in words such as ‘lovers’.)

**Options:**
- 67
- 58
- 71
- 49

In [68]:
%%sql 
Select count (*) as movie_count
from movies
where title LIKE '%Love%';

 * sqlite:///TMDB.db
Done.

[(71,)]

**Question 9**

How many movies were released between the dates 1 August 2012 and 31 July 2013?  

**Options:**
- 227 
- 295
- 3
- 208

In [62]:
%%sql 
Select count (*) as movie_count
from movies
WHERE release_date BETWEEN '2012-08-01' AND '2013-07-31' ;

 * sqlite:///TMDB.db
Done.

[(227,)]

**Question 10**

You have had a long day and want to sit back and enjoy a movie.  Unfortunately, today you are only in the mood for a very specific type of movie. It definitely needs to be in English. It should also be new, something after 1 Jan 2010, but not too new as you might have seen it recently, so it must have been released before 1 Jan 2016. It should also be a romantic movie, so make sure it has the word love somewhere in the title.  You also want it to be a big blockbuster, so the budget of the move must be more than $10 000 000.

What is the movie with the highest popularity that meets all of your requirements?

**Options:**
-  Love & Other Drugs
- From Paris with Love
-  Crazy, Stupid, Love
- Eat Pray Love

In [69]:
%%sql
Select title, popularity as movie_count
from movies
Where original_language = 'en'
      AND title LIKE '%love%'
      AND release_date BETWEEN '2010-01-01' AND '2016-01-01' 
      AND budget >= 1000000
order by popularity DESC
LIMIT 1;

 * sqlite:///TMDB.db
Done.

[('Crazy, Stupid, Love.', 37.990705)]